payalneg/esp-box-emu/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3 board defaults
# Build: idf.py -DBOARD_TARGET=WAVESHARE_P4 set-target esp32p4

CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Cache
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Watchdogs — disable for emulators (long frames)
# CONFIG_ESP_INT_WDT is not set
# CONFIG_ESP_TASK_WDT_EN is not set
# CONFIG_ESP_TASK_WDT_INIT is not set

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=40000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=10240

# FATFS
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=16384
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
CONFIG_FATFS_SECTOR_4096=y

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_MEM_SIZE_KILOBYTES=50
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28=y

# Size optimization to fit in SRAM
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# USB MSC
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_MOUNT_PATH="/sdcard"

# SPI flash
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# DPI double-buffering (smooth LVGL rendering without draw_bitmap stalls)
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Debug
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
